src/Documents/ИС_ЯМ_ФормированиеПоставкиFBO.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_ЯМ_ФормированиеПоставкиFBO</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогоНоменклатуры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаркированныйТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_ЯМ_СоответствиеХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_ЯМ_СоответствиеХарактеристик</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураЯМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры25.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры25</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХарактеристикаЦО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Цена</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвратТоваровОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_MP_ТипУниверсальногоШтрихкода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_MP_ТипУниверсальногоШтрихкода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляПовторнойПечатиКоробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляСозданияНовойКоробки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторнаяПечатьШК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменитьТипШкДляПечати</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ИС_MP_Баркоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_MP_Баркоды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_MP_ТипУниверсальногоШтрихкода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШтрихкодыУпаковокТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ШтрихкодыУпаковокТоваров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗначениеШтрихкода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_ЯМ_ФормированиеПоставкиFBO/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиКомандФормы  

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура СформироватьФайл(Команда)     
	
	Табличныйдокумент = СформироватьТабличныйДокументOzon(); 
	
	Если Табличныйдокумент <> Неопределено Тогда
		Табличныйдокумент.Показать(); 
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура ПечатьУниверсальныхШтрихкодовНажатие(Элемент)
	ОткрытьФорму("Справочник.ИС_MP_Баркоды.ФормаСписка");
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура СоздатьДокументОтгрузки(Команда)
	
	Комиссия25 = ИспользуетсяСхемаКомиссии25();
	
	Если Комиссия25 Тогда
		ФормаНовогоДокумента = ПолучитьФорму("Документ.ПередачаТоваровХранителю.Форма.ФормаДокумента");	
	Иначе	
		ФормаНовогоДокумента = ПолучитьФорму("Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента");
		//+ ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367	
		ФормаНовогоДокумента.Элементы.ГруппаДоговор.Видимость = Истина;
		//- ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367
	КонецЕсли;       
	
	//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592	
	ФормаНовогоДокумента.Элементы.Договор.Доступность = Истина;
	//+ ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367	
	//ФормаНовогоДокумента.Элементы.ГруппаДоговор.Видимость = Истина;
	//- ИнфоСофт Стояк Ю.К. 18.03.2025 УА #96367
	//- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592
	
	ДанныеФормы = ФормаНовогоДокумента.Объект;
	
	ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25);
	
	КопироватьДанныеФормы(ДанныеФормы, ФормаНовогоДокумента.Объект);

    ФормаНовогоДокумента.Модифицированность = Истина;
	
    ФормаНовогоДокумента.Открыть();  
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура ПечатьШк(Команда)
	
	Выделенные = Элементы.Товары.ВыделенныеСтроки;
	
	Для Каждого Индекс Из Выделенные Цикл         
		Строка = Объект.Товары.Получить(Индекс); 
		Для Колво = 1 По Строка.Количество Цикл
			ТабДок = ПечатьШтрихкода(Строка.Штрихкод);  		
			ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);	
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ВвестиШтрихкодВручную(Команда)

	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
		
	//+ ИнфоСофт Власова И.С. 13.02.25 УА #93336	
	//ШтрихкодированиеИСКлиент.ПоказатьВводШтрихкода(Оповещение);
	ИС_MP_МаркировкаКлиент.ПоказатьВводШтрихкода(Оповещение);
	//- ИнфоСофт Власова И.С. 13.02.25 УА #93336
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

#КонецОбласти

#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные) 
	
	Если Не ЗначениеЗаполнено(Объект.Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран Профиль", , , "Профиль");
		Возврат;
	КонецЕсли;
		
	//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269	
	//ВнешнееСобытиеНаСервере(Данные);
	ТабДок = ВнешнееСобытиеНаСервере(Данные);   
	
	//+ ИнфоСофт Власова И.С. 21.04.25 УА #99627
	//Если ЗначениеЗаполнено(ТабДок) Тогда
	Если Не ТабДок = Неопределено И ТабДок.ВысотаТаблицы > 0 Тогда
	//- ИнфоСофт Власова И.С. 21.04.25 УА #99627
		ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	КонецЕсли;                                  
	//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаКлиенте
Процедура ПриОткрытии(Отказ)     	
	
	ЭтаФорма.ИспользоватьПодключаемоеОборудование = Истина;
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода"); 
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Результат = ТоварыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ТоварыХарактеристикаПриИзменении(Элемент)
	
	ОчиститьСообщения();
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные; 
	Результат = ТоварыНоменклатураПриИзмененииНаСервере(ТекущиеДанные.Номенклатура, ТекущиеДанные.Характеристика);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Функция ПолучитьТипGS1_DataMatrixНаСервере()
	Возврат Перечисления.ТипыШтрихкодов.GS1_DataMatrix;  
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ПолучитьТоварыПоQrКоду(qrКод)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода = &ЗначениеШтрихкода
	|
	|СГРУППИРОВАТЬ ПО
	|	ШтрихкодыУпаковокТоваров.Номенклатура,
	|	ШтрихкодыУпаковокТоваров.Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	|	ВТ_Номенклатура.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ_НоменклатураГруппировка
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НоменклатураГруппировка.Номенклатура КАК Номенклатура,
	|	ВТ_НоменклатураГруппировка.Характеристика КАК Характеристика,
	|	ИСТИНА КАК МаркированныйТовар,
	|	ИС_ЯМ_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.vendorCode КАК Артикул
	|ИЗ
	|	ВТ_НоменклатураГруппировка КАК ВТ_НоменклатураГруппировка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|			ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ = ИС_ЯМ_Штрихкоды.Владелец
	|		ПО ВТ_НоменклатураГруппировка.Номенклатура = ИС_ЯМ_СоответствиеХарактеристик.Номенклатура
	|			И ВТ_НоменклатураГруппировка.Характеристика = ИС_ЯМ_СоответствиеХарактеристик.Характеристика
	|ГДЕ
	|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("ЗначениеШтрихкода", qrКод);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по qr коду " + qrКод); 		
		ДанныеНайдены = Ложь;                       
		Возврат;		
	КонецЕсли;	
		
	ДанныеНайдены = Истина;	
	
	ДобавитьТоварыПоШтрихкоду(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ПолучитьТоварыПоШтрихкоду(Данные)  
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИС_ЯМ_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_ЯМ_Штрихкоды.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Размер
	|ИЗ
	|	Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|ГДЕ
	|	ИС_ЯМ_Штрихкоды.Наименование = &Штрихкод
	|	И ИС_ЯМ_Штрихкоды.Профиль = &Профиль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛОЖЬ КАК МаркированныйТовар,
	|	ВТ_Размер.Штрихкод КАК Штрихкод,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.vendorCode КАК Артикул
	|ИЗ
	|	ВТ_Размер КАК ВТ_Размер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ПО ВТ_Размер.Ссылка.Владелец = ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);  
	Запрос.УстановитьПараметр("Штрихкод", Данные); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по штрихкоду: " + Данные); 		
		ДанныеНайдены = Ложь;                       
		Возврат;		
	КонецЕсли;	
		
	ДанныеНайдены = Истина;	
	
	ДобавитьТоварыПоШтрихкоду(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ДобавитьТоварыПоШтрихкоду(ТоварыДляДобавления) 	
		
	//Выполним проверку на уникальность уже отсканированных позиций
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", ТоварыДляДобавления[0].Номенклатура);
	Отбор.Вставить("Характеристика", ТоварыДляДобавления[0].Характеристика); 
	Отбор.Вставить("Штрихкод", ТоварыДляДобавления[0].Штрихкод);
	
	МассивНайденныхСтрок = Объект.Товары.НайтиСтроки(Отбор);
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
		МассивНайденныхСтрок[0].Количество = МассивНайденныхСтрок[0].Количество + 1;
		//ЗначениеВРеквизитФормы(Товары, "Товары");
		Возврат;
	КонецЕсли;	
	
	//Если ранее таких позиций не было, добавим их в дерево			
	Для Каждого Элемент Из ТоварыДляДобавления Цикл
		Стр = Объект.Товары.Добавить();			
		
		Стр.Номенклатура = Элемент.Номенклатура;
		Стр.Характеристика = Элемент.Характеристика; 
		Стр.Штрихкод = Элемент.Штрихкод; 
		Стр.МаркированныйТовар = Элемент.МаркированныйТовар;
		Стр.Артикул = Элемент.Артикул;
		Стр.Количество = 1;
		
	КонецЦикла;   
	
	//ЗначениеВРеквизитФормы(Товары, "Товары");
	
	ПоследнийШтрихкод = ТоварыДляДобавления[0].Штрихкод;	
		
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Функция СформироватьТабличныйДокумент(ТаблицаВыгрузки)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаВыгрузки); 
	Построитель.ВыводитьЗаголовокОтчета = Ложь;
	Построитель.Вывести(ТабличныйДокумент);
	Колво = Объект.Товары.Количество();
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.УдалитьОбласть(ТабличныйДокумент.Область("R1C1:R" + Строка(Колво + 1) + "C1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТабличныйДокумент.Область("R1C2:R1C2").Текст = "имя (необязательно)"; 
	ТабличныйДокумент.Область("R1C1:R" + Строка(Колво + 1) + "C1").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C2:R" + Строка(Колво + 1) + "C2").ШиринаКолонки = 20;
	ТабличныйДокумент.Область("R1C3:R" + Строка(Колво + 1) + "C3").ШиринаКолонки = 20;
	
	Возврат ТабличныйДокумент;
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Функция СформироватьТабличныйДокументOzon()
	ТаблицаВыгрузки = Новый ТаблицаЗначений;
	
	ТаблицаВыгрузки.Колонки.Добавить("артикул", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50)));
	ТаблицаВыгрузки.Колонки.Добавить("имя_необязательно_", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)), "имя (необязательно)"); 
	ТаблицаВыгрузки.Колонки.Добавить("количество", Новый ОписаниеТипов("число"));
		
	Если Объект.Товары.Количество() < 1 Тогда
		ОбщегоНазначения.СообщитьПользователю("Сначала необходимо заполнить таблицу товаров.");
		Возврат Неопределено;	
	КонецЕсли;
	
	Для Каждого Строка Из Объект.Товары Цикл
		СтрокаТЗ = ТаблицаВыгрузки.Добавить();
		СтрокаТЗ.артикул = Строка.Артикул;
		СтрокаТЗ.имя_необязательно_ = "";					
		СтрокаТЗ.количество = Строка.Количество;
	КонецЦикла;	
	
	
	ТабДок = СформироватьТабличныйДокумент(ТаблицаВыгрузки);
	
	Возврат ТабДок
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482	

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)   
		
	ТекущийОбъект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	ТекущийОбъект.ИтогоНоменклатуры = Объект.Товары.Количество();	                     
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482 

//+ ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482
&НаСервере
Функция ПечатьШтрихкода(Штрихкод)
	
	Данные = ПолучитьДанныеДляФормированияЭтикетки(Штрихкод);  
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_ЯМ_ФормированиеПоставкиFBO.ПФ_MXL_Штрихкод58х40_ЯМ");
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.ИмяПараметровПечати = "Этикетка";		
	
	ОбластьМакетаОсновныеДанные = Макет.ПолучитьОбласть("Этикетка"); 
	
	ОбластьМакетаОсновныеДанные.Параметры.Заполнить(Данные);
	
	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	
	ПараметрыШК.Ширина = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
	ПараметрыШК.Высота = Окр(ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
	ПараметрыШК.РазмерШрифта = 10;
	ПараметрыШК.Штрихкод = Штрихкод;
	ПараметрыШК.Масштабировать = Истина;
	ПараметрыШК.СохранятьПропорции = Истина;
	ПараметрыШК.ВертикальноеВыравнивание = 2;
	
	СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);
	
	Если СтруктураКартинки.Результат Тогда	
		ОбластьМакетаОсновныеДанные.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
	КонецЕсли;  
	
	ТабличныйДокумент.Вывести(ОбластьМакетаОсновныеДанные);   
	
	Возврат ТабличныйДокумент;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482
Функция ПолучитьСтруктуруФормированияШтрихкода(Штрихкод)
	
	СтруктураШтрихкода = Новый Структура;
	
	СтруктураШтрихкода.Вставить("Ширина", 280);
	СтруктураШтрихкода.Вставить("Высота", 100);
	СтруктураШтрихкода.Вставить("ТипКода", 1);
	СтруктураШтрихкода.Вставить("ОтображатьТекст", Истина);
	СтруктураШтрихкода.Вставить("Штрихкод", Штрихкод);
	
	Возврат СтруктураШтрихкода;

КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482
Функция ПолучитьДанныеДляФормированияЭтикетки(Штрихкод) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИС_ЯМ_Номенклатура.shopSku КАК shopSku,
	|	ИС_ЯМ_Штрихкоды.Наименование КАК Штрихкод,
	|	ИС_ЯМ_Номенклатура.Ссылка КАК Ссылка,
	|	ИС_ЯМ_Номенклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Номенклатура КАК ИС_ЯМ_Номенклатура
	|		ПО ИС_ЯМ_Штрихкоды.Владелец = ИС_ЯМ_Номенклатура.Ссылка
	|ГДЕ
	|	ИС_ЯМ_Штрихкоды.Наименование = &Штрихкод
	|	И ИС_ЯМ_Номенклатура.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Результат = Новый Структура;   
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		Результат.Вставить("Штрихкод", ВыборкаДетальныеЗаписи.Штрихкод);
		Результат.Вставить("Артикул", ВыборкаДетальныеЗаписи.shopSku); 	

		МассивАртикулов = Новый Массив;
		МассивАртикулов.Добавить(ВыборкаДетальныеЗаписи.shopSku);
		
		ТелоЗапроса = Новый Структура;
		ТелоЗапроса.Вставить("offerIds", МассивАртикулов);
		
		//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97269		
		//Результат = ИС_ЯМ_Сервер.ПолучитьИнформациюОКарточкахПоАртикулу(Объект.Профиль, ТелоЗапроса); 
		ДанныеКарточки = ИС_ЯМ_Сервер.ПолучитьИнформациюОКарточкахПоАртикулу(Объект.Профиль, ТелоЗапроса); 		
		
		//Если Результат = Неопределено Тогда                                                                
		Если ДанныеКарточки = Неопределено Тогда
		//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97269
			Результат.Вставить("Наименование", ВыборкаДетальныеЗаписи.Наименование);
			Прервать;
		КонецЕсли;
		
		//+ ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97269		
		//Для Каждого Товар Из Результат.offerMappings Цикл	
		Для Каждого Товар Из ДанныеКарточки.offerMappings Цикл	
		//- ИнфоСофт Стояк Ю.К. 01.04.2025 УА #97269
			Если Товар.Свойство("offer") Тогда 
				Результат.Вставить("Наименование", Товар.offer.name);
			КонецЕсли;			
		КонецЦикла;
		
	КонецЦикла;  
	
	Возврат Результат;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482
Функция НайтиПроверочныйШК(ШК)
 	Элемент = Справочники.ИС_MP_Баркоды.НайтиПоРеквизиту("Штрихкод", ШК); 
	Если ЗначениеЗаполнено(Элемент) Тогда
		Элемент = Элемент.ПолучитьОбъект();
		Возврат Элемент.Тип;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции //- ИнфоСофт Стояк Ю.К. 22.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ЗаполнитьДанныеНаСервере(ДанныеФормы, Комиссия25)
		
	УстановитьПривилегированныйРежим(Истина);

	Профиль = Объект.Профиль;   
	
	ФукнциональныеОпции = ИС_ЯМ_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	Организация = ФукнциональныеОпции.Организация; 
	Партнер = ФукнциональныеОпции.ПартнерЯМ; 
	Соглашение = ФукнциональныеОпции.СоглашениеЯМ;
	Контрагент = ФукнциональныеОпции.КонтрагентЯМ;
	Договор = ФукнциональныеОпции.ДоговорЯМ;
	
	Если Не ЗначениеЗаполнено(Партнер) Тогда
		ТекстСообщения = СтрШаблон(
			"Не заполнен контрагент в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
			Профиль);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");

		Если ЗначениеЗаполнено(Договор) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Договор, "ХозяйственнаяОперация") = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПередачаНаКомиссию") Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранный договор контрагента в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли;
				ХозОперация = Договор.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнен договор контрагента в настройках для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;

	ИспользоватьСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Если ИспользоватьСоглашенияСКлиентами Тогда
		Если ЗначениеЗаполнено(Соглашение) Тогда
			Если Не Общегоназначения.ЗначениеРеквизитаОбъекта(Соглашение, "ХозяйственнаяОперация") = ХозОперация Тогда
				ТекстСообщения = СтрШаблон(
					"В выбранное соглашение с клиентом в настройках профиля для аккаунта: %1 имеет хозяйственную операцию отличающуюся от ""Передача на комиссию"". Документ отчет комиссионера не создан.",
					Профиль);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Возврат;
			КонецЕсли; 
			ХозОперация = Соглашение.ХозяйственнаяОперация;
		Иначе
			ТекстСообщения = СтрШаблон(
				"Не заполнено соглашение с клиентом в настройках профиля для аккаунта: %1. Документ отчет комиссионера не создан.",
				Профиль);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	КонецЕсли;  
	
	Если Комиссия25 Тогда
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.ПередачаТоваровХранителю"));	
	Иначе	
		НовыйДокумент = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.РеализацияТоваровУслуг"));	
	КонецЕсли;
	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	ДанныеЗаполнения = Новый Структура;
	ДанныеЗаполнения.Вставить("Организация", Организация);
	ДанныеЗаполнения.Вставить("Партнер", Партнер);
	ДанныеЗаполнения.Вставить("Контрагент", Контрагент);
	ДанныеЗаполнения.Вставить("Договор", Договор);
	ДанныеЗаполнения.Вставить("Соглашение", Соглашение);
	ДанныеЗаполнения.Вставить("ЗаполнятьПоСоглашению", Истина);

	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Партнер 				= Партнер;
	НовыйДокумент.Контрагент 			= Контрагент;
	НовыйДокумент.Договор 	 			= Договор;
	НовыйДокумент.Соглашение 			= Соглашение; 
		
	Если Не Комиссия25 Тогда
		НовыйДокумент.ХозяйственнаяОперация = ХозОперация;
	Иначе
		НовыйДокумент.ХозяйственнаяОперация	= Перечисления.ХозяйственныеОперации.ПередачаНаКомиссию;		
	КонецЕсли; 	
	
	ТаблицаТранзакций = ПолучитьСписокТоваров();
	
	ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц"); 
	
	Если Не Комиссия25 Тогда
		СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("Организация, НалогообложениеНДС, Дата",
			НовыйДокумент.Организация, НовыйДокумент.НалогообложениеНДС, НовыйДокумент.Дата));
		СтруктураДействий.Вставить("ПересчитатьСуммуНДС",
			ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(НовыйДокумент));
		СтруктураДействий.Вставить("ПересчитатьСумму");
		СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", Новый Структура("ЦенаВключаетНДС",
			НовыйДокумент.ЦенаВключаетНДС));
	КонецЕсли;
	
	ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(НовыйДокумент.Товары, СтруктураДействий, Неопределено);
	
	ЗначениеВДанныеФормы(НовыйДокумент, ДанныеФормы);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482	

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Процедура ЗаполнитьТЧДокумента(НовыйДокумент, ТаблицаТранзакций)
	
	НовыйДокумент.Товары.Очистить();
	НовыйДокумент.ВидыЗапасов.Очистить();  
	
	ВидЦены = Объект.Профиль.ВидЦены;
	
	Для Каждого Транзакция Из ТаблицаТранзакций Цикл
		
		Если Транзакция.ЭтоНабор Тогда
			РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Транзакция.Номенклатура,
			"ТипНоменклатуры, ВидНоменклатуры");
			
			ПараметрыКомплектующих = ПодборТоваровКлиентСервер.ПараметрыТовара();
			ПараметрыКомплектующих.Номенклатура   		= Транзакция.Номенклатура;
			ПараметрыКомплектующих.НоменклатураНабора   = Транзакция.Номенклатура;
			ПараметрыКомплектующих.ХарактеристикаНабора = Транзакция.Характеристика;				
			ПараметрыКомплектующих.КоличествоУпаковок	= Транзакция.Количество;
			ПараметрыКомплектующих.ТипНоменклатуры 		= РеквизитыНоменклатуры.ТипНоменклатуры;
			ПараметрыКомплектующих.ВидНоменклатуры 		= РеквизитыНоменклатуры.ВидНоменклатуры;
			ПараметрыКомплектующих.ЭтоТовар 			= Истина;
			ПараметрыКомплектующих.Вставить("ВариантКомплектацииНоменклатуры", Неопределено);
			
			Склады = Новый Массив;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("Дата", 		НовыйДокумент.Дата);
			ДополнительныеПараметры.Вставить("Валюта", 		НовыйДокумент.Валюта);
			ДополнительныеПараметры.Вставить("Склады", 		Склады);
			ДополнительныеПараметры.Вставить("Соглашение", 	НовыйДокумент.Соглашение);
			ДополнительныеПараметры.Вставить("Цена", 		Транзакция.Цена);
			ДополнительныеПараметры.Вставить("СуммаПродажиКРаспределению", Транзакция.Цена);	
			ДополнительныеПараметры.Вставить("ВидЦены", ВидЦены);
			//+ ИнфоСофт Стояк Ю.К. 28.02.2025 УА #93644
			ДополнительныеПараметры.Вставить("Комиссия", 0);
			//- ИнфоСофт Стояк Ю.К. 28.02.2025 УА #93644
						
			Комплектующие = ИС_МП_УправлениеЗаказами.Комплектующие(ПараметрыКомплектующих, ДополнительныеПараметры);			
			
			Для Каждого стрКомплекта Из Комплектующие Цикл
				НоваяСтрока = НовыйДокумент.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, стрКомплекта);
				//+ ИнфоСофт Стояк Ю.К. 07.03.2025 УА #9559				
				//НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
				//НоваяСтрока.КоличествоУпаковок 		= НоваяСтрока.КоличествоУпаковок;
				//- ИнфоСофт Стояк Ю.К. 07.03.2025 УА #95592
				НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество + стрКомплекта.Погрешность;
				НоваяСтрока.Склад 					= НовыйДокумент.Склад;
			КонецЦикла;						
		Иначе
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			НоваяСтрока.Номенклатура 			= Транзакция.Номенклатура;
			НоваяСтрока.Характеристика 			= Транзакция.Характеристика;				
			НоваяСтрока.Количество			 	= Транзакция.Количество;
			НоваяСтрока.КоличествоУпаковок 		= Транзакция.Количество;
			НоваяСтрока.Цена 					= Транзакция.Цена;
			НоваяСтрока.Сумма 					= НоваяСтрока.Цена * НоваяСтрока.Количество;
			НоваяСтрока.ВидЦены 				= ВидЦены;
			НоваяСтрока.Склад 					= НовыйДокумент.Склад;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Функция ПолучитьСписокТоваров()
	
	Если ПолучитьФункциональнуюОпцию("ИспользуетсяЦенообразование25") Тогда
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатуры25СрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(, ) КАК ЦеныНоменклатуры25СрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены)";
		
	Иначе
		Текст =
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	&Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Количество КАК Количество,
		|	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена,
		|	ВЫБОР
		|		КОГДА
		|			ВТ_Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор)
		|		ТОГДА
		|			ИСТИНА
		|		ИНАЧЕ
		|			ЛОЖЬ
		|		КОНЕЦ КАК ЭтоНабор
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ) КАК ЦеныНоменклатурыСрезПоследних
		|			ПО (ВТ_Товары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура)
		|				И (ЦеныНоменклатурыСрезПоследних.ВидЦены = &ВидЦены)";
	КонецЕсли;	
	
	
	Запрос = Новый Запрос(Текст); 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("OzonВидЦеныСоСкидкой");
	
	Настройки = ИС_MP_Сервер.ПолучитьНастройки(Объект.Профиль, МассивПараметров);
	
	Если Настройки <> Неопределено Тогда	
		ВидЦеныOzon = Настройки["OzonВидЦеныСоСкидкой"];
	Иначе
		ВидЦеныOzon = Справочники.ВидыЦен.ПустаяСсылка();			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦеныOzon);
	Запрос.УстановитьПараметр("Товары", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482	

//+ ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482
&НаСервере
Функция ИспользуетсяСхемаКомиссии25()  
	
	ИспользоватьДоговорыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	Профиль = Объект.Профиль;   
	
	ФукнциональныеОпции = ИС_ЯМ_Сервер.ПолучитьНастройкиФункциональностиСборочныхЗвданий(Профиль);
	//+ ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89598	
	//Соглашение = ФукнциональныеОпции.СоглашениеOzon;
	//Договор = ФукнциональныеОпции.ДоговорOzon;
	Соглашение = ФукнциональныеОпции.СоглашениеЯМ;	
	Договор = ФукнциональныеОпции.ДоговорЯМ;
	//- ИнфоСофт Стояк Ю.К. 15.12.2024 УА #89598
	
	
	Если ИспользоватьДоговорыСКлиентами Тогда
		Если Не ЗначениеЗаполнено(Договор) Тогда
			Возврат Ложь;
		Иначе
			Возврат Договор.КомиссионныеПродажи25;	
		КонецЕсли;
	Иначе
		Если Не ЗначениеЗаполнено(Соглашение) Тогда
			Возврат Ложь;
		Иначе
			Возврат Соглашение.КомиссионныеПродажи25;	
		КонецЕсли;	
	КонецЕсли;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.2024 УА #69482

//+ ИнфоСофт Стояк Ю.К. 25.10.24 УА #69482
&НаСервере
Функция ВнешнееСобытиеНаСервере(Данные)
	
	РезультатРазбора = ИС_MP_Маркировка.РазборКодаМаркировки(СокрЛП(Данные));
	
	Если РезультатРазбора <> Неопределено И РезультатРазбора.ТипШтрихкода = ПолучитьТипGS1_DataMatrixНаСервере() Тогда
		ПолучитьТоварыПоQrКоду(РезультатРазбора.НормализованныйКодМаркировки);				
	Иначе
		Тип = НайтиПроверочныйШК(Данные);  
		
		Если ЗначениеЗаполнено(Тип) Тогда        			
			Если Тип = ПредопределенноеЗначение("Перечисление.ИС_MP_ТипУниверсальногоШтрихкода.ПовторнаяПечатьШК") Тогда		       
				ТабДок = ПечатьШтрихкода(ПоследнийШтрихкод);
				ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
				//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269				
				//Возврат;
				Возврат Неопределено;                       
				//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
			Иначеесли Тип = ПредопределенноеЗначение("Перечисление.ИС_MP_ТипУниверсальногоШтрихкода.ИзменитьТипШкДляПечати") Тогда		       
				ТипШтрихкода = (ТипШтрихкода + 1) % 3; 
				//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
				//Возврат;
				Возврат Неопределено;                       
				//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
			КонецЕсли;						
		Иначе
			ПолучитьТоварыПоШтрихкоду(Данные);	
		КонецЕсли;  
		
	КонецЕсли;
	
	Объект.ИтогоНоменклатуры = Объект.Товары.Количество();
	    	
	Если АвтоПечать И ДанныеНайдены Тогда
		ТабДок = ПечатьШтрихкода(ПоследнийШтрихкод);
		//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269		
		//ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		Возврат ТабДок;
		//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
	КонецЕсли;
	
	//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
	Возврат Неопределено;
	//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 25.10.24 УА #69482

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Данные, ДополнительныеПараметры) Экспорт
	
	Если Данные.Штрихкод <> "" Тогда
		//+ ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269		
		//ВнешнееСобытиеНаСервере(СокрЛП(Данные.Штрихкод));		
		ТабДок = ВнешнееСобытиеНаСервере(СокрЛП(Данные.Штрихкод));   
	
		Если ТабДок <> Неопределено Тогда
			ТабДок.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
		КонецЕсли;                                  
		//- ИнфоСофт Стояк Ю.К. 31.03.2025 УА #97269
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

//+ ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340
&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура = Неопределено, Характеристика = Неопределено)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Характеристика) Тогда
		Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ КАК МаркированныйТовар,
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура КАК Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика КАК Характеристика,
	|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku КАК Артикул,
	|	МАКСИМУМ(ИС_ЯМ_Штрихкоды.Наименование) КАК Штрихкод
	|ИЗ
	|	РегистрСведений.ИС_ЯМ_СоответствиеХарактеристик КАК ИС_ЯМ_СоответствиеХарактеристик
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ЯМ_Штрихкоды КАК ИС_ЯМ_Штрихкоды
	|		ПО ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ = ИС_ЯМ_Штрихкоды.Владелец
	|ГДЕ
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура = &Номенклатура
	|	И ИС_ЯМ_СоответствиеХарактеристик.Характеристика = &Характеристика
	|	И ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.Профиль = &Профиль
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_ЯМ_СоответствиеХарактеристик.Номенклатура,
	|	ИС_ЯМ_СоответствиеХарактеристик.Характеристика,
	|	ИС_ЯМ_СоответствиеХарактеристик.НоменклатураЯМ.shopSku";
	
	Запрос.УстановитьПараметр("Профиль", Объект.Профиль);  
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура); 
	Запрос.УстановитьПараметр("Характеристика", Характеристика); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда		
		ОбщегоНазначения.СообщитьПользователю("Не найдены данные по указанной позиции"); 		
		ДанныеНайдены = Ложь;                       
		Возврат Неопределено;		
	КонецЕсли;
	
	ТЗ = РезультатЗапроса.Выгрузить(); 
	Структура = Новый Структура;
	
	Для Каждого ИмяКолонки Из ТЗ.Колонки Цикл		
		Структура.Вставить(ИмяКолонки.Имя, ТЗ[0][ИмяКолонки.Имя]);
	КонецЦикла;
		
	ДанныеНайдены = Истина;	
	
	Возврат Структура;
	
КонецФункции //- ИнфоСофт Стояк Ю.К. 24.10.2024 УА #76340

#КонецОбласти
